// สำหรับเทส ข้อมูลตัวอย่าง
// let message = {
//   title: "คู่มือเที่ยวเกาะช้าง กิน เที่ยว พักที่ไหนดี? อ่านจบครบที่เดียว!",
//   eid: "1",
//   url: "https://www.wongnai.com/trips/travel-koh-chang",
//   description:
//     "วันว่างนี้ไปเที่ยวเกาะช้างกัน พร้อมทำกิจกรรมต่าง ๆ เช่น เที่ยวน้ำตก ล่องเรือชมป่าชายเลน ขี่ช้างท่องป่า ผจญภัยเหนือยอดไม้ และดำน้ำตื้น รับรอทริปนี้สนุกแน่!\n\n“เกาะช้าง” จังหวัดตราด ที่เที่ยวทะเลใกล้กรุงเทพฯ สามารถเที่ยวกันได้ทุกฤดู เคลียร์งานและวันว่างได้แล้วก็แค่จัดกระเป๋าไปกันได้เลยกับแพลน เที่ยวเกาะช้าง ต้องไปกิน เที่ยว พักที่ไหน? อ่านจบครบที่เดียว! ซึ่งหลายคนสงสัยว่าไปเกาะช้างเที่ยวไหนดี? Wongnai Travel บอกเลยเกาะช้างไม่ได้มีแค่ไปเล่นน้ำทะเล หรือนอนพักริมหาดทรายเท่านั้น เพราะมีกิจกรรมสนุก ๆ รออยู่เพียบ ชนิดที่ไม่ว่างให้นอนอยู่ห้องเฉย ๆ อย่าง เที่ยวชมน้ำตก พายเรือคายัค ล่องเรือมาด ชมธรรมชาติป่าชายเลน ขี่ช้างท่องป่า ตื่นเต้นกับการผจญภัยเหนือยอดไม้ ดำน้ำตื้นชมปะการังและฝูงปลาแบบใกล้ชิด นอกจากนี้ยังมีที่พักเกาะช้าง และร้านอาหารเกาะช้าง มาให้เลือกกันอีกด้วย รับรองทริปนี้กินอิ่ม นอนหลับ เที่ยวสนุกแน่นอน",
//   photos: [
//     "https://img.wongnai.com/p/1600x0/2019/07/02/3c758646aa6c426ba3c6a81f57b20bd6.jpg",
//     "https://img.wongnai.com/p/1600x0/2019/07/02/6a2733ab91164ac8943b77deb14fdbde.jpg",
//     "https://img.wongnai.com/p/1600x0/2019/07/02/941dbb607f0742bbadd63bbbd993e187.jpg",
//     "https://img.wongnai.com/p/1600x0/2019/07/02/bd1d256256c14c208d0843a345f75741.jpg",
//   ],
//   tags: ["เกาะ", "ทะเล", "จุดชมวิว", "ธรรมชาติ", "ตราด"],
// };

export function ShowCard({ message, index }) {
  // ตัดข้อความเกิน 100 ตัว
  function cutOver100Text(text, maxLength = 100) {
    if (text.length > maxLength) {
      return text.substring(0, maxLength) + "...";
    }
    return text;
  }

  // เอาหมวดมาต่อกัน และลงท้ายด้วย "และ" ก่อนตัวท้าย
  function addWordinArray(tags) {
    if (tags.length <= 1) return tags; // ถ้ามีคำเดียวหรือไม่มีเลย ให้ return กลับเลย

    // แต่ถ้ามีมากกว่า 1 เพิ่ม "และ" ระหว่างรายการก่อนหน้ากับรายการสุดท้าย
    const result = [...tags.slice(0, -1), "และ", tags[tags.length - 1]];
    return result;
  }

  return (
    <>
      <div
        className={`flex flex-row gap-6 rounded-2xl  items-center justify-start py-[24px] w-full `}
      >
        <div>
          <img
            className="min-w-[400px] max-w-[400px] max-h-96 rounded-2xl"
            src={message.photos[0]}
            alt=""
          />
        </div>

        <div className="flex flex-col gap-6 w-[70%]">
          <div className="flex flex-col gap-1">
            <h2 className="text-3xl font-bold text-gray-700">
              {cutOver100Text(message.title)}
            </h2>
            <p className=" text-gray-500">
              {cutOver100Text(message.description)}
            </p>
            <a
              className="text-sky-400 underline inline-block"
              href={message.url}
              target="_blank" //กดลิ้งแล้วเปิด tab ใหม่
            >
              อ่านต่อ
            </a>
            <div className="flex gap-2 text-gray-500">
              <p>หมวด</p>
              {addWordinArray(message.tags).map((tag, index) => (
                <p
                  key={index}
                  className={`${tag === "และ" ? "" : "underline "}`} //ใส่ underline ในคำ ยกเว้นคำว่า 'และ'
                >
                  {tag}
                </p>
              ))}
            </div>
          </div>

          <div className="flex flex-row justify-between">
            <div className="flex flex-row gap-3">
              {message.photos.slice(1).map((photo, index) => (
                <img
                  key={index}
                  className="w-28 h-28 rounded-2xl"
                  src={photo}
                  alt={`Photo ${index + 1}`}
                />
              ))}
            </div>
            <div className="flex items-end">
              <div className="border-4 rounded-full border-sky-500 w-16 h-16 flex justify-center items-center">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  xmlnsXlink="http://www.w3.org/1999/xlink"
                  fill="#0ea5e9"
                  width="40px"
                  height="40px"
                  viewBox="0 0 72 72"
                  enableBackground="new 0 0 72 72"
                  xmlSpace="preserve"
                >
                  <g>
                    <g>
                      <path d="M18.321,69.07c-2.874,0-5.775-0.845-8.31-2.604l-0.534-0.371c-6.614-4.593-8.259-13.712-3.666-20.326l13.931-18.588    c2.183-3.146,5.522-5.292,9.361-5.984c3.839-0.694,7.717,0.152,10.921,2.377l0.534,0.37c2.72,1.888,4.735,4.676,5.675,7.85    c0.313,1.059-0.291,2.172-1.351,2.485c-1.058,0.311-2.171-0.29-2.485-1.351c-0.691-2.337-2.116-4.308-4.119-5.698l-0.534-0.37    c-2.328-1.617-5.146-2.231-7.931-1.727c-2.787,0.503-5.212,2.061-6.828,4.388L9.055,48.108    c-3.293,4.744-2.099,11.365,2.704,14.701l0.534,0.371c4.801,3.334,11.423,2.142,14.759-2.66l4.256-6.126    c0.631-0.905,1.875-1.129,2.784-0.501c0.906,0.631,1.131,1.877,0.501,2.784l-4.256,6.125C27.504,66.882,22.948,69.07,18.321,69.07    z" />
                    </g>
                    <g>
                      <path d="M40.297,51.043c-2.877,0-5.784-0.844-8.323-2.606l-0.538-0.375c-2.718-1.888-4.731-4.674-5.669-7.845    c-0.313-1.06,0.292-2.172,1.351-2.485c1.063-0.313,2.173,0.291,2.485,1.351c0.69,2.335,2.114,4.305,4.117,5.696l0.538,0.375    c4.799,3.332,11.421,2.138,14.757-2.664l13.93-18.59c3.294-4.744,2.1-11.365-2.703-14.701l-0.53-0.365    c-2.332-1.621-5.147-2.232-7.936-1.731c-2.787,0.503-5.212,2.061-6.828,4.388l-4.255,6.125c-0.63,0.908-1.876,1.132-2.783,0.502    s-1.132-1.876-0.502-2.783l4.255-6.125c2.225-3.205,5.564-5.351,9.404-6.043c3.838-0.691,7.718,0.153,10.922,2.379l0.529,0.365    c6.62,4.598,8.264,13.717,3.67,20.33l-13.93,18.59C49.453,48.868,44.914,51.043,40.297,51.043z" />
                    </g>
                    <g>
                      <path d="M52.76,33.106c-0.209,0-0.419-0.065-0.599-0.2c-0.442-0.331-0.532-0.958-0.2-1.399l0.548-0.73    c0.331-0.442,0.959-0.53,1.399-0.2c0.442,0.331,0.532,0.958,0.2,1.399l-0.548,0.73C53.364,32.969,53.064,33.106,52.76,33.106z" />
                    </g>
                    <g>
                      <path d="M55.047,30.056c-0.209,0-0.419-0.065-0.599-0.2c-0.442-0.331-0.532-0.958-0.2-1.399l4.426-5.904    c1.061-1.528,1.471-3.414,1.134-5.28c-0.337-1.867-1.38-3.491-2.938-4.572l-0.343-0.237c-0.454-0.315-0.567-0.938-0.253-1.392    c0.313-0.454,0.936-0.568,1.392-0.253l0.344,0.238c1.997,1.387,3.334,3.468,3.766,5.86s-0.094,4.81-1.48,6.806l-4.447,5.934    C55.651,29.918,55.352,30.056,55.047,30.056z" />
                    </g>
                  </g>
                </svg>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
